{
    "vps": {
        "title": "Virtual Patient Simulator",
        "description": "This project aims to provide Medical and Health Science students at the University of Auckland with a tool that supports interactive and immersive education through virtual patient scenarios.",
        "content": [
            {
                "name": "Note",
                "content": "This project was associated with The University of Auckland SOFTENG 761 but since 2022, is being developed by WDCC project teams"
            },
            {
                "name": "Personal Contributions",
                "content": "Responsible for the Help Modal and Scene Navigator."
            }
        ],
        "stack": ["react", "firebase", "mongodb", "sass"],
        "link": {
            "website": "https://vps-uoa.netlify.app/",
            "github": "https://github.com/UoaWDCC/VPS"
        },
        "tags": ["Web App", "Health", "Education", "Tool"]
    },
    "xivtracker": {
        "title": "XIV Tracker",
        "description": "A tool to help players keep track of their character progress through the critically acclaimed MMORPG Final Fantasy XIV.",
        "content": [
            {
                "name": "Acknowledgements",
                "content": "XIV Tracker utilizes the community made XIVAPI for all its API requests."
            },
            {
                "name": "Features",
                "content": "Notable features of XIV Tracker include. Global Search - Every character; past and present; is available. No matter what server or data center they reside in. Character Profile - View basic information about a character (name, title, free company, grand company, attributes, etc). Equipment - View the current job and equipped gear, with tooltips that display stats, glamour and materia affixed to the item (if applicable). Jobs - View the current level and experience points of all jobs; this includes jobs from the disciple of war, magic, hand and land. Collection - View aquired mounts and minions. Quests - View all quests and encounters (trials, dungeons and raids), with indicators for completed activities. Has EorzeaDB tooltip integration. Achievements - View completed achievements. Reference Character - Allows users hide/show sensitive information based on the allocated reference character. Themes - Supports two themes, dark and light. Dynamic Backgrounds - Dynamically changes the background splash to reflect the current expansion most relevant to the reference character. FAQ - Frequently Asked Questions (FAQ) and instructions to identify the Lodestone ID of a character. Completion Metric - Jobs, Collection, Quests and Achievements all have an associated completion metric to indicate overall progress with respect to each aspect."
            },
            {
                "name": "License",
                "content": "XIV Tracker is released under the MIT license."
            },
            {
                "name": "Disclaimer",
                "content": "XIV Tracker is not affiliated with SQUARE ENIX CO,. LTD. FINAL FANTASY XIV CONTENT IS PROPERTY OF SQUARE ENIX CO,. LTD."
            }
        ],
        "stack": ["html", "css", "js", "react"],
        "link": {
            "website": "https://www.xivtracker.gg/",
            "github": "https://github.com/DamonGreenhalgh/xivtracker"
        },
        "tags": ["Web App", "Stats", "Profile"]
    },
    "gameoflife": {
        "title": "Conway's Game of Life",
        "description": "A Java application that simulates the cellular automaton.",
        "content": [],
        "stack": ["java"],
        "link": {
            "github": "https://github.com/DamonGreenhalgh/conways-game-of-life"
        },
        "tags": ["App", "Simulation", "Game"]
    },
    "matrix": {
        "title": "Matrix Package",
        "description": "A package for Java that implements the Matrix mathematical structure.",
        "content": [],
        "stack": ["java"],
        "link": {
            "github": "https://github.com/DamonGreenhalgh/matrix-package"
        },
        "tags": ["Matrix", "Math", "Tool", "Package"]
    }
}
